# A few of my favorite brews
cask_args appdir: '/Applications'

# Tap extra
tap 'buo/cask-upgrade'
tap 'caskroom/cask'
tap 'caskroom/fonts'
tap 'homebrew/command-not-found'
tap 'homebrew/services'

brew 'zsh'
brew 'git'
brew 'gnupg'
brew 'pinentry-mac'
brew 'gnu-getopt'
brew 'gnu-tar'
brew 'htop-osx'
brew 'p7zip'
brew 'python'
brew 'python3'
brew 'rbenv'
brew 'wget'

brew 'ccache'
brew 'clang-format'
brew 'cmake'
brew 'doxygen'
brew 'lcov'
brew 'ninja'
brew 'pkg-config'
brew 'watchman'

brew 'emojify'
brew 'ffmpeg'
brew 'ghostscript'
brew 'imagemagick'
brew 'png2ico'

cask 'font-fira-code'
cask 'font-fira-sans'
cask 'gimp'
cask 'inkscape'
